; domain
(define (domain tearoom)
  (:requirements :strips :typing)
  (:types bowl)
  (:predicates (set_on ?x - bowl ?y - bowl)
         (on_tatami ?x - bowl)
         (unstacked ?x - bowl)
         (hands_idle)
         (cradling ?x - bowl)
         )

  (:action lift_bowl
       :parameters (?x - bowl)
       :precondition (and (unstacked ?x) (on_tatami ?x) (hands_idle))
       :effect
       (and (not (on_tatami ?x))
       (not (unstacked ?x))
       (not (hands_idle))
       (cradling ?x)))

  (:action place_bowl
       :parameters (?x - bowl)
       :precondition (cradling ?x)
       :effect
       (and (not (cradling ?x))
       (unstacked ?x)
       (hands_idle)
       (on_tatami ?x)))

  (:action nest_atop
       :parameters (?x - bowl ?y - bowl)
       :precondition (and (cradling ?x) (unstacked ?y))
       :effect
       (and (not (cradling ?x))
       (not (unstacked ?y))
       (unstacked ?x)
       (hands_idle)
       (set_on ?x ?y)))
  (:action separate_atop
       :parameters (?x - bowl ?y - bowl)
       :precondition (and (set_on ?x ?y) (unstacked ?x) (hands_idle))
       :effect
       (and (cradling ?x)
       (unstacked ?y)
       (not (unstacked ?x))
       (not (hands_idle))
       (not (set_on ?x ?y))))

)

; problem
(define (problem tearoom-p04)
(:domain tearoom)
(:objects bowl1 bowl2 bowl3 bowl4 bowl5  - bowl)
(:init
(hands_idle)
(on_tatami bowl1)
(on_tatami bowl2)
(set_on bowl3 bowl2)
(set_on bowl4 bowl5)
(on_tatami bowl5)
(unstacked bowl1)
(unstacked bowl3)
(unstacked bowl4)
)
(:goal
(and
(set_on bowl2 bowl5)
(set_on bowl3 bowl2)
(set_on bowl4 bowl1))
)
)

; plan
1. (separate_atop bowl4 bowl5)
   deleted: (unstacked bowl4) (hands_idle) (set_on bowl4 bowl5)
   added: (cradling bowl4) (unstacked bowl5)
   goals met: 1 of 3
2. (nest_atop bowl4 bowl1)
   deleted: (cradling bowl4) (unstacked bowl1)
   added: (unstacked bowl4) (hands_idle) (set_on bowl4 bowl1)
   goals met: 2 of 3
3. (separate_atop bowl3 bowl2)
   deleted: (unstacked bowl3) (hands_idle) (set_on bowl3 bowl2)
   added: (cradling bowl3) (unstacked bowl2)
   goals met: 1 of 3
4. (place_bowl bowl3)
   deleted: (cradling bowl3)
   added: (unstacked bowl3) (hands_idle) (on_tatami bowl3)
   goals met: 1 of 3
5. (lift_bowl bowl2)
   deleted: (on_tatami bowl2) (unstacked bowl2) (hands_idle)
   added: (cradling bowl2)
   goals met: 1 of 3
6. (nest_atop bowl2 bowl5)
   deleted: (cradling bowl2) (unstacked bowl5)
   added: (unstacked bowl2) (hands_idle) (set_on bowl2 bowl5)
   goals met: 2 of 3
7. (lift_bowl bowl3)
   deleted: (on_tatami bowl3) (unstacked bowl3) (hands_idle)
   added: (cradling bowl3)
   goals met: 2 of 3
8. (nest_atop bowl3 bowl2)
   deleted: (cradling bowl3) (unstacked bowl2)
   added: (unstacked bowl3) (hands_idle) (set_on bowl3 bowl2)
   goals met: 3 of 3
